[
  {
    "text": "When deciding between two job offers, do you choose the one that excites you personally or the one that fits better with your long-term career plans?",
    "options": ["Personal Excitement", "Long-Term Career Plans"],
    "functionTypes": ["Fi", "Ti"]
  },
  {
    "text": "When making a decision that affects both a close friend and a distant acquaintance, do you choose based on your personal relationship with each person or on what you logically believe will have the best outcome?",
    "options": ["Personal Relationship", "Logical Outcome"],
    "functionTypes": ["Fi", "Ti"]
  },
  {
    "text": "When planning a surprise for someone, do you consider what would genuinely delight them or what you think will fit best with their lifestyle?",
    "options": ["Genuinely Delight", "Fit with Lifestyle"],
    "functionTypes": ["Fi", "Ti"]
  },
  {
    "text": "When there's a disagreement in a group, do you focus on finding a resolution to keep the group in harmony or on sticking to your own viewpoint, even if it causes friction?",
    "options": ["Finding Resolution", "Sticking to Your Viewpoint"],
    "functionTypes": ["Fe", "Fi"]
  },
  {
    "text": "When choosing a gift for a friend, do you pick something that you know they'll love based on their interests or something that you personally think is meaningful?",
    "options": ["Friend's Interests", "Your Own Meaning"],
    "functionTypes": ["Fe", "Fi"]
  },
  {
    "text": "When choosing a side in a debate, do you base your decision on which side will foster the most productive discussion or on which side you personally agree with?",
    "options": ["Productive Discussion", "Personal Agreement"],
    "functionTypes": ["Fe", "Fi"]
  },
  {
    "text": "When planning a personal goal, do you focus more on your vision of the end result and how it aligns with your long-term aspirations, or on the practical steps and past experiences that have led to success in similar situations?",
    "options": [
      "Vision and Long-Term Aspirations",
      "Practical Steps and Past Success"
    ],
    "functionTypes": ["Ni", "Si"]
  },
  {
    "text": "When making a significant life decision, do you rely more on your intuitive insights and future projections of how things might turn out, or on analyzing past experiences and detailed information related to similar decisions?",
    "options": [
      "Intuitive Insights and Future Projections",
      "Past Experiences and Detailed Information"
    ],
    "functionTypes": ["Ni", "Si"]
  },
  {
    "text": "When organizing an event, do you prefer to imagine how the event will unfold and what the overall experience will be, or follow a detailed checklist based on how similar events were successfully managed before?",
    "options": [
      "Imagined Experience and Vision",
      "Detailed Checklist and Past Management"
    ],
    "functionTypes": ["Ni", "Si"]
  },
  {
    "text": "When visiting a new restaurant, do you stick to familiar dishes you know you'll enjoy or try something new that catches your eye on the menu?",
    "options": ["Familiar Dishes", "New Dishes"],
    "functionTypes": ["Si", "Se"]
  },
  {
    "text": "When decorating your home, do you choose styles that have worked for you in the past or experiment with new trends and ideas?",
    "options": ["Proven Styles", "New Trends"],
    "functionTypes": ["Si", "Se"]
  },
  {
    "text": "When picking a movie to watch, do you choose based on a detailed review or synopsis that provides in-depth analysis, or do you go with an intriguing poster and brief description that catches your eye?",
    "options": ["Detailed Review/Synopsis", "Intriguing Poster/Description"],
    "functionTypes": ["Si", "Se"]
  },
  {
    "text": "When shopping for a new gadget, do you rely on detailed product reviews and specifications based on past performance or choose based on the latest features and innovations that capture your attention?",
    "options": [
      "Detailed Reviews/Specifications",
      "Latest Features/Innovations"
    ],
    "functionTypes": ["Si", "Se"]
  },
  {
    "text": "When organizing a big event, do you stick to a standard checklist to make sure everything is covered or create a customized plan based on what has worked well in the past?",
    "options": ["Standard Checklist", "Customized Plan"],
    "functionTypes": ["Te", "Ti"]
  },
  {
    "text": "When tackling a new business process, do you implement a proven method to streamline things or analyze the specific needs to adapt your approach?",
    "options": ["Proven Method", "Adapt Based on Needs"],
    "functionTypes": ["Te", "Ti"]
  },
  {
    "text": "When participating in a debate, do you focus on using logical arguments supported by evidence or on presenting your personal perspective and reasoning?",
    "options": [
      "Logical Arguments and Evidence",
      "Personal Perspective and Reasoning"
    ],
    "functionTypes": ["Te", "Ti"]
  },
  {
    "text": "When starting a new project, do you create a detailed plan based on your vision or brainstorm different possibilities before making a final decision?",
    "options": ["Detailed Plan", "Brainstorm Possibilities"],
    "functionTypes": ["Ni", "Ne"]
  },
  {
    "text": "When writing a story, do you focus on developing a deep and detailed plot or come up with multiple ideas and see which one becomes the most interesting?",
    "options": ["Detailed Plot", "Multiple Ideas"],
    "functionTypes": ["Ni", "Ne"]
  },
  {
    "text": "When tackling a complex problem, do you prefer to delve deeply into one approach and refine it or explore various potential solutions and adapt based on what works best?",
    "options": ["Deeply Refining One Approach", "Exploring Various Solutions"],
    "functionTypes": ["Ni", "Ne"]
  },
  {
    "text": "When organizing a community event, do you prioritize detailed logistics and planning or responding to the needs and feedback of attendees and volunteers?",
    "options": ["Detailed Logistics and Planning", "Needs and Feedback"],
    "functionTypes": ["Te", "Fe"]
  },
  {
    "text": "When comforting a friend who’s going through a tough time, do you prefer to talk about ways to solve their problem or offer emotional support and empathy?",
    "options": ["Problem-Solving", "Emotional Support"],
    "functionTypes": ["Te", "Fe"]
  },
  {
    "text": "When preparing for a family gathering, do you prioritize creating a detailed plan to ensure everything runs smoothly or making sure that each family member’s needs and preferences are taken into account?",
    "options": [
      "Detailed Plan for Smooth Operation",
      "Considering Each Family Member’s Needs"
    ],
    "functionTypes": ["Te", "Fe"]
  },
  {
    "text": "When you discover a new hobby, do you dive right in to experience it or think about how you might develop it into a long-term passion?",
    "options": ["Dive Right In", "Think Long-Term"],
    "functionTypes": ["Se", "Ne"]
  },
  {
    "text": "While hiking, are you more focused on enjoying the immediate surroundings or thinking about how the experience could inspire future projects or ideas?",
    "options": ["Enjoying Surroundings", "Thinking About Future Projects"],
    "functionTypes": ["Se", "Ne"]
  },
  {
    "text": "When trying a new recipe, do you follow the instructions closely to ensure the result is as expected or experiment with different ingredients to create your own version?",
    "options": ["Follow Instructions Closely", "Experiment with Ingredients"],
    "functionTypes": ["Se", "Ne"]
  }
]
